Revit 2027 API
BuiltInFailures.StructuralCustomConnectionFailures.SimpleConnectionTooFarRefs Property
 Simple Structural Connection Handler cannot connect too far elements
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId SimpleConnectionTooFarRefs { get; }
Public Shared ReadOnly Property SimpleConnectionTooFarRefs As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ SimpleConnectionTooFarRefs {
	FailureDefinitionId^ get ();
}
static member SimpleConnectionTooFarRefs : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.StructuralCustomConnectionFailures Class
Autodesk.Revit.DB Namespace